{
    "competitions": {
        "Architecture": [
            "120 Hours Challenge: International architecture competition that challenges students to design and propose innovative solutions to a given architectural problem or brief, with a tight deadline of just 120 hours to complete the task. Requires students to think creatively, work efficiently, and produce high-quality designs that meet the needs of the brief. Open to grades 9-12. https://www.120hours.no/",
            "Architecture At Zero: International design competition focused on decarbonization, equity, and resilience. Participants are tasked with designing new buildings, such as the the Griffith STEAM Magnet Middle School in 2024. Open to grades 9-12. https://www.architectureatzero.com/",
            "International Bridge Building Contest: Challenges high school students to design, construct, and test model bridges that adhere to specific engineering specifications. The competition emphasizes the application of physics and engineering principles, encouraging students to develop efficient and innovative bridge designs. Open to grades 9-12. http://bridgecontest.phys.iit.edu/",
            "The Architect's Chair: Design competition that challenges participants to create innovative and functional furniture designs, with a focus on sustainability, aesthetics, and user experience. Open to grades 9-12. https://architecturecompetitions.com/thearchitectschair",
            "Last Nuclear Bomb Memorial Competition: International architecture competition invites participants to design a memorial situated within a decommissioned nuclear weapon testing site. The objective is to reflect on the history and ongoing threat of nuclear weapons, promoting public awareness and advocating for disarmament. Open to all students. https://architecturecompetitions.com/nuclearbombmemorial3/",
            "Legendary Highway 14 Tower Competition: Design challenge that asks students to envision and propose a iconic and functional tower structure along Highway 14, with the goal of creating a landmark that showcases innovative design, sustainability, and community engagement. The competition requires students to consider the tower's relationship to its surroundings, its potential impact on the local environment and community, and its ability to serve as a symbol of innovation. Open to grades 9-12. https://architecturecompetitions.com/highwaytower14/",
            "Los Angeles Affordable Housing Competition: Design challenge that asks students to develop innovative and sustainable solutions to address the affordable housing crisis in Los Angeles. The competition requires students to consider the complex social, economic, and environmental factors that contribute to the housing crisis, and to design solutions that are not only aesthetically pleasing but also functional. Open to grades 9-12. https://architecturecompetitions.com/losangeleschallenge/"
        ],
        "Art": [
            "Congressional Art Competition: Invites students to submit their original artwork for exhibition and recognition, with a focus on promoting artistic talent and creativity among young people. The competition is sponsored by the U.S. House of Representatives, with the winning artwork from each district being displayed in the U.S. Capitol Building for one year. Open to grades 9-12. https://www.house.gov/educators-and-students/congressional-art-competition",           
            "Doodle for Google: Students are invited to create their own Google Doodle for the chance to have it featured on Google.com, as well as win some scholarships and tech packages for them and their schools. Open to grades K-12. https://doodles.google.com/d4g/faq/",
            "Horticulture Art Contest: creative competition that encourages youth to express horticultural themes through various art forms, such as drawing, painting, or mixed media. Participants are evaluated on creativity, composition, and how effectively their artwork conveys horticultural concepts. Open to ages 8-22. https://www.njha.org/horticulture-art-contest.html",
            "Junior Duck Stamp Contest: National art competition that invites students to submit their original artwork featuring North American waterfowl, with a focus on promoting conservation, wildlife awareness, and artistic expression among young people. The contest is sponsored by the U.S. Fish and Wildlife Service and is designed to encourage students to learn about waterfowl and wetland conservation, while also developing artistic skills. Open to grades K-12 https://www.fws.gov/program/junior-duck-stamp/junior-duck-stamp-contest-information",
            "National Scholastic Art & Writing Awards: Recognizes creative excellence in visual arts and writing, offering students opportunities for scholarships and national recognition. Open to grades 7-12. https://www.artandwriting.org/awards/how-to-enter/",
            "River of Words Contest: National poetry and art contest that invites students to explore and express their connection to the natural world, with a focus on promoting environmental awareness, creativity, and self-expression. The contest encourages students to submit their original poetry and artwork that reflects their observations, feelings, and thoughts about the natural world. Open to grades K-12. https://www.stmarys-ca.edu/centers-institutes/center-environmental-literacy/river-of-words",
            "Writing, Visual, Multimedia Contest: Creative competition that challenges students to express their thoughts, ideas, and imagination through a variety of mediums, including writing, visual arts, and media productions. The contest invites students to submit their original work and to showcase their skills in storytelling, critical thinking, and creative expression. Open to grades 6-12. https://quillandscroll.org/2024-writing-photo-multimedia-contest-results/",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18). https://youngarts.org/",
            "Youth Art Contest: Encourages young artists to express their creativity and showcase their artistic talents, with the goal of promoting art education and recognizing emerging artists. Each year has a new theme for students to share their unique perspectives and visions through various forms of visual art. Open to grades 1-12. https://nedsmithcenter.org/education-2/#youthartcontest"
        ],
        "Biology": [
            "American Regional Biology Competition: Rigorous academic competition that tests students' knowledge and understanding of biology, challenging them to demonstrate their mastery of concepts, principles, and theories in the life sciences. To participate, students must take a comprehensive exam that covers a wide range of biology topics, from molecular biology and genetics to ecology and evolution. Open to grades 9-12. https://biologycompetition.org/",
            "AnatoBee (Difficulty ★★★★☆): Tests students' knowledge of human anatomy, embryology, and histology through a series of challenging questions and interactive activities. Participants engage in online quizzes and exams that assess their understanding of anatomical structures and physiological functions. Open to grades 9-12. https://anatobee.org/", 
            "Annual DNA Day Essay Contest: Science writing competition that invites students to explore the latest advances and discoveries in genetics and genomics, and to express their thoughts and ideas about the impact of these developments on society. To participate, students must submit an essay that addresses a specific theme or question related to genetics and genomics. Open to grades 9-12. https://www.ashg.org/dna-day/",
            "BioGENEius Challenge: Conduct innovative research in biotechnology, covering fields like healthcare, agriculture, and environmental sustainability. Students present their research to industry leaders and compete at national and international levels. Open to grades 9-12. https://biotechinstitute.org/biogeneius/", 
            "Brain Awareness Video Contest: Annual competition organized by the Society for Neuroscience (SfN) that invites participants worldwide to create engaging and educational videos that explore neuroscience concepts in an entertaining manner. Students must contact a SfN member near them to participate. Open to grades 9-12. https://www.brainfacts.org/For-Educators/Programs-and-Events/Brain-Awareness-Video-Contest",
            "Brain Bee (Difficulty ★★★☆☆): Neuroscience competition that tests knowledge of the brain, nervous system, and neurological diseases. Aims to inspire students to pursue careers in neuroscience and medicine through competitive experiences. Open to grades 9-12. https://www.thebrainbee.org/", 
            "Neuroscience Research Prize: Recognizes and rewards outstanding research in the field of neuroscience, encouraging students and young researchers to pursue innovative and groundbreaking projects that advance our understanding of the brain and nervous system. To be considered for the prize, applicants must submit a research paper or project that demonstrates a significant contribution to the field of neuroscience. Open to grades 9-12. https://aan.secure-platform.com/a/gallery/rounds/7/details/7068",
            "Genes in Space: Students design and propose experiments to study the effects of microgravity on living organisms, with the goal of advancing our understanding of the biological effects of space travel and potentially contributing to the development of new technologies for space exploration. Winning experiments are conducted aboard the International Space Station. Open to grades 7-12. https://www.genesinspace.org/",
            "International Biology Bowl: Competitive event that brings together students from around the world to test their knowledge and skills in biology, with a focus on teamwork, strategy, and quick thinking. Teams of students participate in a quiz-bowl style competition, answering questions on a wide range of biology topics, from cellular and molecular biology to ecology and conservation biology. Open to grades 9-12. https://biologybowl.org/",
            "International Genetically Engineered Machine (iGEM): Global synthetic biology competition where teams design and build innovative biological systems using genetic engineering. Fosters collaboration, research, and problem-solving to address real-world challenges in healthcare, sustainability, and technology. Open to grades 9-12. https://competition.igem.org/", 
            "USA Biology Olympiad (USABO) (Difficulty ★★★★☆): Challenges students on advanced biological concepts through rigorous exams, with top students advancing to represent the US at the International Biology Olympiad. Open to grades 9-12. https://www.usabo-trc.org/"
        ],
        "Business & Finance": [
            "Blue Ocean Student Entrepreneurship Challenge (Difficulty ★★★★☆): Largest virtual entrepreneurship competition where participants develop and pitch innovative business ideas using Blue Ocean Strategy principles in order to gain real entrepreneurship experience. Open to grades 9-12. https://blueoceancompetition.org/", 
            "Conrad Challenge: Entrepreneurship competition that encourages high school students to develop creative solutions to global challenges. Participants work in teams to design, research, and present their ideas, gaining mentorship and the opportunity to bring their ideas into fruition. Open to ages 13-18. https://www.conradchallenge.org/", 
            "DECA Competitive Events: Test students' skills and knowledge in marketing, management, and entrepreneurship, with events ranging from written exams and role-playing scenarios to presentations and case studies, all designed to simulate real-world business situations. Open to grades 9-12. https://www.deca.org/compete",
            "Diamond Challenge for High School Entrepreneurs (Difficulty ★★★★☆): Global entrepreneurship competition where students develop and pitch unique business ideas. Participants create business models and compete for funding, mentorship, and networking opportunities to bring their ideas to life. Open to grades 9-12. https://diamondchallenge.org/",
            "International Economics Olympiad: Global competition that tests students' knowledge of economics, including microeconomics, macroeconomics, and international trade. Participants go through multiple rounds of online challenges, case studies, and exams, competing to showcase their economics proficiency. Open to grades 9-12. https://ieo-official.org/",
            "Microsoft Imagine Cup Junior (Difficulty ★★★★★): Global technology competition that empowers student developers to create innovative applications addressing real-world challenges. Participants utilize Microsoft technologies to transform their ideas into market-ready solutions. Open to ages 13-18. https://imaginecup.microsoft.com/en-us/junior",
            "National Business Plan Competition: Prestigious event that brings together student entrepreneurs from across the country to showcase their innovative business ideas and compete for top honors, with the goal of fostering a spirit of entrepreneurship and innovation among young people. Requires students to develop a comprehensive business plan, including market analysis and strategies, and then present their plans to a panel of judges. Requires qualification from Local and Regional Business Plan Competitions. Open to grades 9-12. https://www.competitionsciences.org/competitions/national-business-plan-competition/",
            "National Personal Finance Challenge: Tests students' knowledge and understanding of personal finance concepts, such as budgeting, saving, investing, and managing debt, with the goal of promoting financial literacy and preparing students for independent financial decision-making. Open to grades 9-12. https://www.councilforeconed.org/programs/for-students/national-personal-finance-challenge/",
            "NFTE World Series of Innovation: Invites students to get involved in solving some of the biggest challenges humanity faces today and advance the UN Sustainable Development Goals. Participants submit business ideas with their solutions to real-world problems. Open to grades 9-12. https://innovation.nfte.com/", 
            "NFTE Youth Entrepreneurship Challenge: Participants create and pitch their own business ideas, showcasing their entrepreneurial skills and innovation. Students go through workshops and mentoring to build their ideas, competing for seed capital to launch their business or pursue educational goals. Open to grades 9-12. https://nfte.com/",
            "Trading Day Competition: Simulated trading competition that challenges students to make investment decisions and manage a virtual portfolio, with the goal of earning the highest returns and outperforming their peers. The competition provides a realistic and interactive learning experience, where students can apply their knowledge of finance, economics, and investing to make informed decisions. Open to grades 10 and 11. https://www.stevens.edu/school-business-high-school-programs-trading-day", 
            "Wharton Global High School Investment Competition (Difficulty ★★★★☆): Teams manage a virtual portfolio, making investment decisions based on market conditions and economic factors. Teams compete for the best portfolio performance while gaining valuable experience in financial analysis and decision-making. Open to grades 9-12. https://globalyouth.wharton.upenn.edu/competitions/investment-competition/",
            "Young Investors Society Global Stock Pitch Competition: International competition where students research, analyze, and pitch stock investment ideas in a written report to a panel of judges. Participants demonstrate their understanding of financial markets by providing thorough analyses and presenting compelling investment cases for global companies. Open to grades 9-12. https://yis.org/programs/stock-pitch-competition/"
        ],
        "Chemistry": [
            "Chemagination: Chemistry research competition hosted by Princeton. It focuses on the topics of Alternate Energy, the Environment, Medicine, and New Materials. Open to grades 9-12. https://www.princeton-acs.org/chemagination",
            "ChemiCo: International Olympiad-style chemistry competition that challenges students worldwide on fundamental chemistry concepts, including stoichiometry, reactions, the periodic table, atomic structure, chemical bonding, and experimental chemistry. Open to grades 9-12. https://stemco.org/chemico/",
            "International Chemistry Olympiad: Biggest chemistry competition held annually at various countries around the world. Only the best of the best compete here. Open to grades 9-12. https://www.ichosc.org/",
            "Washington University Chemistry Tournament: Challenges students with a series of individual exams, team-based exams, and relay-style rounds, all designed to assess students' chemistry knowledge and problem-solving skills. The tournament emphasizes real-world applications of chemistry and encourages collaboration among participants. Open to grades 9-12. https://wuct.wustl.edu/",
            "USA National Chemistry Olympiad: Challenges students with advanced chemistry concepts through rigorous exams, with top performers advancing to represent the US at the International Chemistry Olympiad. Open to grades 9-12. https://www.acs.org/education/olympiad.html"
        ],
        "Civics Knowledge & Engagement": [
            "Bill of Rights Institute MyImpact Challenge: Encourages students to design and implement projects that create positive change in their communities, reflecting the principles of the Constitution and civic responsibility. Open to ages 13-19. https://www.billofrightsinstitute.org/my-impact-challenge", 
            "National High School Mock Trial Championship: Nationwide competition where teams simulate courtroom trials, applying legal principles and presenting cases in front of real judges and attorneys. Open to grades 9-12. https://www.nationalmocktrial.org/", 
            "Ninth Circuit Civics Contest (Difficulty ★★★☆☆): Invites students submit an essay or video on topics related to the US Constitution and the justice system, encouraging civic engagement and understanding of constitutional principles. Open to grades 9-12 in the western US or Pacific Islands. https://www.ca9.uscourts.gov/civicscontest/", 
            "Sandra Day O'Connor Civics Challenge (Difficulty ★★★☆☆): Challenges students to express their civics knowledge of the US government and US Constitution through essays, videos, music, and poetry. Open to grades 6-12. https://oconnorinstitute.org/cc/", 
            "United States Senate Youth Program (USSYP): Prestigious initiative that selects two high school student leaders from each U.S. state to participate in a week-long educational experience in Washington, D.C., known as 'Washington Week'. During this program, delegates engage with high-level government officials and receive a college scholarship. Open to grades 11 and 12 (rising juniors and seniors). https://ussenateyouth.org/selection_process_qualify/",
            "VFW Voice of Democracy Program: Provides students with the unique opportunity to express themselves in regards to a democratic and patriotic-themed recorded essay based on this year's theme. Open to grades 9-12. https://www.vfw.org/community/youth-and-education/youth-scholarships", 
            "We The Students Scholarship Contest: Challenges students to write about a current event or issue related to the U.S. Constitution and their rights as citizens. Open to grades 8-12 (ages 14-19). https://studentscholarships.org/scholarship/9432/we-the-students-scholarship-contest"
        ],
        "Computer Science": [
            "American Computer Science League (ACSL): Tests students on fundamental concepts in computer science, ranging from number systems to boolean algebra to digital electronics. In the upper divisions, each contest also includes a problem to solve by programming using Python, C++ or Java. Open to grades K-12. https://www.acsl.org/",
            "Congressional App Challenge (Difficulty ★★☆☆☆): Invites students in the U.S. to submit their apps to be judged by a congressman/woman; winners get their apps displayed in the U.S. Capitol. Open to grades 6-12. https://www.congressionalappchallenge.us/",
            "Code Quest®: Challenges students to solve problems with popular programming languages such as python, java, c++, or c#. The competition covers string manupulation, recursion, mathematics, pathfinding, data structures, and much more. Open to grades 9-12. https://registration.lmcodequestacademy.com/about", 
            "International Olympiad in Informatics (IOI) (Difficulty ★★★★★): In the two day international competition, four students from each country compete in the hardest high school algorithmic competition in the world. Open to grades 9-12. https://ioinformatics.org/",
            "NASA App Development Challenge: Coding competition where students address real-world technical problems related to NASA's deep space exploration missions. Participants develop software applications that contribute to the Artemis program, aiming to land astronauts on the Moon and eventually Mars. Open to grades 6-12. https://www.nasa.gov/learning-resources/app-development-challenge/",
            "NCWIT Aspirations Computing Awards: Awards at different tiers are given to students around the U.S. for computing related achievements. The highest level of recipients may be invited to an award ceremony. Open to grades 9-12.https://www.aspirations.org/award-programs/aic-high-school-award",
            "Stanford ProCo: Annual computer science competition held at Stanford that tests competitors' knowledge of integers, strings, arrays, and much more. There is a Novice and Experienced division as this competition is open to all skill levels. Open to grades 9-12. https://www.stanfordacm.org/proco",
            "USA Computing Olympiad (Difficulty ★★★★★): Prestigious competitive programming contest for students that challenges participants to solve complex algorithmic problems and serves as a pathway to the International Olympiad in Informatics (IOI). Open to all students; however, only pre-college students are eligible for the IOI. https://usaco.org/"
        ],
        "Cybersecurity": [
            "CyberPatriot National Youth Cyber Defense Competition: Nation's largest cyber defense competition where teams act as newly hired IT professionals tasked with managing and securing the network of a small company. They are provided with virtual operating systems containing cybersecurity vulnerabilities and must find and fix these issues while maintaining critical services. Open to grades K-12. https://www.uscyberpatriot.org/",
            "Lockheed Martin CYBERQUEST®: The security industry giant Lockheed Martin runs this yearly competition where students are tasked with completing real world security problems in many different categories including web exploitation, forensics, social engineering, and much more. Open to grades 9-12. https://registration.lmcodequestacademy.com/about",
            "National Cyber League: Competitions are held multiple times a year where participants solve cybersecurity problems and are scored based on accuracy and completion; participants are given a rank depending on where they place overall. Open to ages 13 and older. https://nationalcyberleague.org/competition",
            "NSA Codebreaker: Annually held reverse engineering and low level analysis competition for aspiring Cybersecurity professionals. The NSA makes all the challenges that test skills important to the organization. Open to ages 13 and older. https://nsa-codebreaker.org/home",
            "picoCTF - CMU Cybersecurity Competition (Difficulty ★★★★★): Participants solve problems through Capture The Flag (CTF) format in cryptography, reverse engineering, web exploitation, and forensics while developing real-world cybersecurity skills. Open to ages 13 and older. https://picoctf.org/"
        ],
        "Economics": [
            "High School Fed Challenge: Academic competition that encourages students to deepen their understanding of economics and the Federal Reserve's role in the U.S. economy. Teams conduct research on a designated economic theme, develop analyses, and present their findings through analytical writing. Open to grades 9-12. https://www.newyorkfed.org/outreach-and-education/high-school/high-school-fed-challenge",
            "National Economics Challenge: Tests students' knowledge of microeconomics, macroeconomics, and international economics. Teams of students work through multiple-choice questions and critical thinking scenarios, competing at regional and national levels. Open to grades 9-12. https://www.councilforeconed.org/programs/for-students/national-economic-challenge/"
        ],
        "Fashion": [
            "Fashion Reimagined: Challenges participants to create innovative and environmentally-friendly fashion designs with the goal of reducing waste and promoting a more circular fashion industry. The competition encourages designers to think creatively and push the boundaries of sustainable fashion. Open to grades 9-12. https://liu.edu/fashion-reimagined",
            "ISU Fashion Design Competition: Students tap into their creative side and bring their style to life by submitting a design sketch or window display photo. Provides students who are interested in working in the fashion industry with a chance to showcase their skills while showing off their originality, creativity, and visual voice. Open to grades 9-12. https://fcs.illinoisstate.edu/academics/competitions/#fashion-design-competition",
            "Taiwan Fashion Design Award (TFDA): Prestigious international design competition that aims to discover and nurture emerging talent in the fashion industry, providing a platform for young designers to showcase their creativity, innovation, and technical skills. Open to grades 9-12. https://www.roc-taiwan.org/my_en/post/10591.html"
        ],
        "Film": [
            "Brain Awareness Video Contest: Annual competition organized by the Society for Neuroscience (SfN) that invites participants worldwide to create engaging and educational videos that explore neuroscience concepts in an entertaining manner. Students must contact a SfN member near them to participate. Open to grades 9-12. https://www.brainfacts.org/For-Educators/Programs-and-Events/Brain-Awareness-Video-Contest",
            "Breakthrough Junior Challenge: Invites students to create short videos that explain complex scientific concepts and theories in an engaging, easy-to-understand way, with a focus on promoting science literacy, critical thinking, and creativity. Participants must submit a 3-minute video that explores a topic in physics, mathematics, or life sciences, with the goal of winning a significant scholarship, recognition, and the opportunity to have their video featured on a global platform. Open to ages 13-18. https://breakthroughjuniorchallenge.org/",
            "C-SPAN’s StudentCam Documentary Competition: Annual documentary competition where students create short films on a political or civic issue, exploring its impact on their lives and our nation. Open to grades 6-12. https://www.studentcam.org", 
            "Destination Imagination Film Challenge: Challenges students to produce a short film that tells a story, conveys a message, or showcases their imagination and creativity, with a focus on promoting teamwork, problem-solving, and innovative thinking. The challenge requires students to work together to write, direct, and produce a film that meets specific criteria and constraints, such as a limited timeframe, a specific theme or prop, and a required element of surprise or twist. Open to grades 9-12. https://www.destinationimagination.org/team-film-challenge/",
            "New York Times: Vocabulary Video Challenge: Creative competition that invites students to produce short videos that teach and showcase vocabulary words in an engaging and memorable way, with a focus on promoting language learning, creativity, and effective communication. Open to ages 13-19. https://www.nytimes.com/2024/02/21/learning/our-11th-annual-15-second-vocabulary-video-challenge.html",
            "Slingshot Challenge: Students are challenged to create 1-minute videos describing their ideas for solving environmental issues around the world. Open to ages 13-18. https://www.nationalgeographic.org/society/projects/slingshot/",
            "World of 8 Billion Video Contest: Invites students to create short videos that explore the challenges and opportunities presented by a world with a growing population of 8 billion people, with a focus on sustainability, resource management, and social responsibility. Participants must submit a 60-second video that addresses a specific theme or question related to population growth, such as climate change, food security, or urbanization. Open to grades 6-12. https://www.worldof8billion.org/video-contest/",
            "Writing, Visual, Multimedia Contest: creative competition that challenges students to express their thoughts, ideas, and imagination through a variety of mediums, including writing, visual arts, and media productions. The contest invites students to submit their original work and to showcase their skills in storytelling, critical thinking, and creative expression. Open to grades 6-12. https://quillandscroll.org/2024-writing-photo-multimedia-contest-results/",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18). https://youngarts.org/",
            "Young Filmmakers Contest: Challenges students to create short films, typically focusing on specific themes such as environmental issues or social causes. Participants are encouraged to develop their storytelling and technical skills in video production. Open to ages 25 and under. https://www.oneearthfilmfest.org/contest-details"
        ],
        "Foreign Language & Linguistics": [
            "AATI National Italian Examination (NIE): Annual online contest assessing interpretive listening and reading skills in Italian across six proficiency levels. The exam offers awards such as medals, certificates, scholarships, and study trips to Italy. Requires registration by teacher. Open to grades 6-12. https://www.nationalitalianexam.org/",
            "ACTR Olympiada of Spoken Russian: Annual competition offering students a platform to demonstrate their proficiency in spoken Russian through oral interviews, poetry recitation, and discussions on Russian culture. Participants are evaluated across various levels based on their experience and can earn medals, with top performers potentially qualifying for scholarships and international study opportunities. Open to grades 6-12. https://www.actr.org/Olympiada",
            "National Classical Etymology Exam: Annual online competition designed to assess students' understanding of Latin and Greek roots and their derivatives in the English language. The exam consists of 50 multiple-choice questions, with approximately 75% focusing on Latin and 25% on Greek. Requires registration by teacher. Open to grades 6-12. https://www.njcl.org/Online-Exams/National-Classical-Etymology",
            "National French Contest (Le Grand Concours): Annual competition students take a written test assessing their French language skills, including listening and reading comprehension. Participants compete against peers with similar educational backgrounds for national and regional recognition, with top performers receiving certificates, medals, and other awards. Requires registration by teacher. Open to grades 1-12. https://www.frenchteachers.org/nfc-home",
            "National German Exam: Annual exam that assesses students' German language proficiency through online reading and listening sections. High-achieving students may earn awards, including medals and scholarships, with top scorers eligible for a three-week study trip to Germany through the AATG/PAD National German Exam Scholarship. Requires registration by teacher. Open to grades 9-12. https://www.nge.aatg.org/",
            "National Greek Exam: Annual competition that tests students' knowledge of Ancient Greek through various levels, including Attic and Homeric Greek, via multiple-choice and translation questions. High-scoring students may receive awards and scholarships, such as the ACL/NJCL National Greek Examination Scholarship. Open to grades 6-12. https://www.aclclassics.org/Exams/National-Greek-Exam",
            "National Japan Bowl: High-level competition that tests U.S. students on their knowledge of the Japanese language, as well as Japan's culture, history, and social context. Organized annually by the Japan-America Society of Washington DC, the event brings together approximately 200 top students each spring in Washington, D.C., with top winners earning a cultural study trip to Japan. Open to grades 9-12. https://japanbowl.org/",
            "National Japanese Exam (NJE): Online, proficiency-oriented assessment designed for students learning Japanese as a second language. The exam evaluates students' interpretive reading and listening skills, as well as their understanding of Japanese culture. Requires registration by teacher. Open to grades 6-12. https://www.aatj.org/national-japanese-exam/",
            "National Language Arts League: Nationwide competition assessing students' skills in grammar, vocabulary, reading comprehension, spelling, and analogies through timed multiple-choice exams. Aims to enhance critical thinking and language proficiency, offering awards and national recognition to top-performing individuals and teams. Open to grades 2-12. https://www.cmleague.com/product-category/nlal/",
            "National Latin Exam (NLE): Annual multiple-choice assessment designed to evaluate students' understanding of Latin language and Roman culture across eight proficiency levels. Open to Latin learners worldwide, the exam covers topics such as grammar, vocabulary, mythology, history, and reading comprehension, with high-achieving participants receiving awards and scholarships. Requires registration by teacher. Open to grades 1-12. https://www.nle.org/",
            "National Latin Vocabulary Exam: Annual multiple choice test administered by the National Junior Classical League, assessing students' knowledge of Latin vocabulary based on official level-specific word lists. The exam focuses on nouns, verbs, and other parts of speech. Open to all grades. https://www.njcl.org/Online-Exams/National-Latin-Vocabulary",
            "National Portuguese Exam (NPE): Online assessment that measures students' abilities in listening, reading, and writing in Portuguese. Aims to motivate students to achieve linguistic proficiency and cultural literacy, with participants receiving awards and recognition for their accomplishments. Requires registration by teacher. Open to grades 6-12. https://nationalspanishexam.org/exams/national-portuguese-exam/",
            "National Spanish Exam (NSE): Online, standardized assessment designed to evaluate students' proficiency in vocabulary, grammar, reading, and listening comprehension in Spanish. The exam offers recognition through medals and scholarships, encouraging students to enhance their language skills and cultural understanding. Requires registration by teacher. Open to grades 6-12. https://nationalspanishexam.org/exams/national-spanish-exam/",
            "North American Computational Linguistics Open Competition: Annual contest challenging students to solve complex linguistic puzzles using logic and analytical reasoning. No prior knowledge of linguistics or foreign languages is required. Top performers from the Open Round advance to the Invitational Round, with the highest scorers earning the opportunity to represent North America at the International Linguistics Olympiad. Open to grades 9-12. https://naclo.org/"
        ],
        "General": [
            "Academic Decathlon: Comprehensive academic competition that challenges students to demonstrate their knowledge and skills in a wide range of subjects, including mathematics, science, literature, history, economics, music, and art, as well as speech, interview, and essay writing. Provides a unique opportunity for students to develop their skills, build confidence, and prepare for success in college and beyond. Open to grades 9-12. https://www.usad.org/",
            "Academic WorldQuest™: National competition where students answer questions on international politics, geography, global economics, history, and world culture. Open to grades 9-12. https://worldaffairscouncils.org/what-we-do/academic-worldquest/",
            "Breakthrough Junior Challenge: Invites students to create short videos that explain complex scientific concepts and theories in an engaging, easy-to-understand way, with a focus on promoting science literacy, critical thinking, and creativity. Participants must submit a 3-minute video that explores a topic in physics, mathematics, or life sciences, with the goal of winning a significant scholarship, recognition, and the opportunity to have their video featured on a global platform. Open to ages 13-18. https://breakthroughjuniorchallenge.org/",
            "Cooper Hewitt Design Challenge: National design competition that invites students to develop innovative solutions to real-world problems. Students think about small tweaks that can improve daily life or larger changes that can have a broad impact and use design to help everyone feel at home in their communities. Open to grades 9-12. https://www.cooperhewitt.org/design-competition-design-challenge/",
            "Destination Imagination: International program that fosters creativity, teamwork, and problem-solving skills in students. Participants work in teams to tackle open-ended challenges in various categories, including Science, Technology, Engineering, Arts, and Mathematics (STEAM). Open to grades K-12. https://www.destinationimagination.org/challenge-experience/",
            "Disney Dreamers Academy (Difficulty ★★★★☆): Empowers students to explore their dreams and career aspirations through mentorship, workshops, and networking opportunities. Participants gain hands-on experience and inspiration in various fields, preparing them for future success. Open to grades 9-12. https://www.disneydreamersacademy.com/", 
            "International Geography Olympiad: Tests students' knowledge and skills in geography, with a focus on promoting geographic literacy, critical thinking, and problem-solving. Participants must complete a series of challenging tests and activities, such as mapping, data analysis, and case studies, that assess their understanding of geographic concepts, spatial relationships, and global issues. Open to ages 16-19. http://www.geoolympiad.org/fass/geoolympiad/what-is-igeo/index.shtml",
            "National Academic Championship: Invites students to compete in a series of challenging events, including quizzes and debates, with a focus on promoting academic excellence, critical thinking, and teamwork. The competition features a range of subjects, including history, science, literature, and mathematics, and requires students to demonstrate their knowledge, skills, and strategic thinking in a fast-paced and competitive environment. Open to grades 9-12. https://qunlimited.com/",
            "National Academic League: Teams of students compete across a wide range of subjects through challenges that test teamwork and problem-solving. Students compete in head-to-head rounds, testing their quick recall and critical thinking in a fast-paced, quiz-style format. Open to grades 9-12. https://nationalacademicleague.org/",
            "National High School Ethics Bowl: Challenges teams of students to discuss and debate complex ethical dilemmas, with the goal of developing their critical thinking, moral reasoning, and communication skills. The competition features a series of case studies and scenarios that raise important ethical questions, and teams must work together to analyze the issues and develop well-reasoned arguments. Open to grades 9-12. https://nhseb.org/",
            "National Science Bowl: Tests students’ knowledge in a competition where teams face-off in a fast-paced Q&A format, involving scientific topics such as biology, chemistry, earth science, physics, energy, and math. Open to grades 6-12. https://www.energy.gov/topics/national-science-bowl", 
            "Quest for Excellence Awards: Honors outstanding students, for their achievements and contributions to education, with a focus on promoting excellence, innovation, and community engagement. The awards recognize individuals who demonstrate a commitment to academic rigor and creative thinking in a variety of interests. Open to only grade 11. https://www.questbridge.org/apply-to-college/programs/college-prep-scholars-program/scholarships-and-awards/quest-for-excellence-awards",
            "Quiz Bowl: Academic competition where teams of students compete to answer questions across a wide range of subjects, including history, literature, science, fine arts, current events, popular culture, and sports. Using a buzzer system, teams rapidly respond to questions. Open to grades 6-12. https://www.naqt.com/about/quiz-bowl.html",
            "Regeneron International Science and Engineering Fair (ISEF): World's largest pre-college STEM research competition, where high school students present groundbreaking independent research across various scientific categories. Open to grades 9-12 and requires qualification from local and state fairs. https://www.societyforscience.org/isef/", 
            "Science Olympiad: Challenges students in teams to compete in a series of events covering scientific topics such as biology, chemistry, physics, engineering, and earth science. The event fosters teamwork and problem-solving skills, with students participating in both written and build challenges. Open to grades 6-12. https://www.soinc.org/",
            "Shell Eco-Marathon Competition: Global competition that challenges student teams to design, build, and drive ultra-energy-efficient vehicles. Participants compete in two main categories: Prototype, which focuses on futuristic, streamlined designs, and UrbanConcept, which emphasizes practical, roadworthy vehicles. Teams select from energy sources such as battery-electric, hydrogen fuel cell, or internal combustion engines using fuels like gasoline, ethanol, or diesel. Open to grades 9-12. https://www.shellecomarathon.com/2025-programme.html#tab-local-competitions",
            "Technology Student Association (TSA) Competitions: Offers 40 competitions, covering a wide variety of areas such as engineering, computer science, biotechnology, and digital media. Participants compete at the regional, state, and national levels to apply their skills in different scenarios. Open to grades 9-12. https://tsaweb.org/competitions",
            "Tests of Engineering Aptitude, Mathematics, and Science (TEAMS): Annual, theme-based STEM competition for where student teams apply their knowledge of science, technology, engineering, and mathematics to collaboratively solve real-world engineering challenges. Students compete at state competitions for a chance to compete at the National TEAMS Competition. Open to grades 6-12. https://tsaweb.org/teams"
        ],
        "History": [
            "AFSA National High School Essay Contest: Challenges students to analyze and write about foreign policy and diplomacy, encouraging a deeper understanding of international affairs. Open to grades 9-12. https://afsa.org/essay-contest", 
            "Emerson and Fitzhugh Prizes: Awarded by The Concord Review and recognizes exceptional history research papers published in the journal. The Emerson Prize honors multiple students annually for outstanding scholarship, while the Fitzhugh Prize is awarded to one student each year for the most distinguished essay. Open to grades 9-12. https://tcr.org/submit",
            "Joseph S. Rumbaugh Historical Oration Contest: Invites students to deliver a 5 to 6 minute original speech on an event, personality, or document from the American Revolution that reflects the ideals of liberty and independence. Contestants are judged on composition, delivery, historical accuracy, and relevance to American principles. Open to grades 9-12. https://www.sar.org/joseph-s-rumbaugh-historical-oration-contest/",
            "Profile in Courage Essay Contest by JFK Presidential Library: Invites students to describe and analyze an act of political courage by a US elected official who served during or after 1917, the year JFK was born. Open to grades 9-12. https://www.jfklibrary.org/learn/education/profile-in-courage-essay-contest", 
            "National Genealogical Society Rubincam Youth Award: Challenges students to submit original genealogical research papers, encouraging them to explore and document their family history. Winners receive cash prizes, plaques, and a one-year NGS membership, with submissions evaluated on research quality, documentation, and narrative presentation. Open to grades 6-12. https://www.ngsgenealogy.org/competitions/rubincam-youth-award/",
            "National Hellenic Civilization Exam: Evaluates students' knowledge of ancient Greek history and culture from the Minoan period (2000 BC) to the death of Alexander the Great. The exam mainly focuses on the Hellenic period, covering topics such as politics, society, mythology, and daily life. Open to all grades. https://www.njcl.org/Online-Exams/National-Hellenic-Civilzation",
            "National History Bowl: Quiz competition that tests teams of students on their knowledge of global history across a wide selection of eras. Students form teams of 6 students in this buzzer-based competition. Open to grades 12. and under https://www.iacompetitions.com/vjvhistorybowl/",
            "National History Day (NHD): Encourages students to conduct original research on historical topics aligned with an annual theme, with projects presented as papers, exhibits, performances, documentaries, or websites. Participants advance through local and state competitions for a chance to present their work at the national level held at the University of Maryland, College Park. Open to grades 6-12. https://nhd.org/en/contest/get-started/",
            "National Roman Civilization Exam: Annual online competition that assesses students' knowledge of ancient Roman history and culture from 753 BC to the end of Constantine the Great's reign. The exam is a 45 minute multiple choice test that covers topics such as Roman society, politics, military, and daily life. Open to all grades. https://www.njcl.org/Online-Exams/National-Roman-Civilization",
            "World Historian Student Essay Competition: Invites students to address how global historical topics leave impacts on the modern world, encouraging deep research and critical thinking. Open to grades K-12. https://www.thewha.org/wha-awards/world-historian-student-essay-competition/#!"
        ],
        "Math": [
            "American Invitiational Mathematics Examination (AIME) (Difficulty ★★★★☆): Tests students’ problem-solving and mathematical reasoning abilities through 15 multiple-choice questions, and top scorers are eligible for further rounds of competition. Must qualify through AMC 10 or AMC 12. https://artofproblemsolving.com/wiki/index.php/American_Invitational_Mathematics_Examination", 
            "American Mathematics Competition 10 (AMC 10) (Difficulty ★★★☆☆): Challenges students by testing their problem-solving skills and mathematical reasoning through 25 multiple-choice questions. Open to grades 10 and under. https://maa.org/student-programs/amc/", 
            "American Mathematics Competition 12 (AMC 12) (Difficulty ★★★☆☆): Challenges students by testing their problem-solving skills and mathematical reasoning through 25 multiple-choice questions. Open to grades 12 and under. https://maa.org/student-programs/amc/",
            "American Regions Mathematics League (ARML): Brings together teams of students from different regions to compete in a series of challenging mathematical events, including individual and team tests, as well as a power question that requires collaborative problem-solving. Open to grades 9-12. https://arml3.com/",
            "Caribou Mathematics Contests: Online competitions held six times annually for students from kindergarten through grade 12. These contests challenge participants with engaging math problems and interactive puzzles, aiming to enhance problem-solving skills and foster a love for mathematics. Requires registration by teacher. Open to all grades. https://www.cariboutests.com/public/participate.php#upcoming" ,
            "COMAP's High School Mathematical Contest in Modeling (HiMCM): Challenges high school students to solve real-world problems using mathematical models. Teams of students collaborate to analyze the problem, create a model, and write a detailed report explaining their solution. Open to grades 12 and under. https://www.comap.com/contests/himcm-midmcm", 
            "Continental Mathematics League: National mathematics competition designed to enhance problem-solving skills through a series of timed written tests administered during the school year. Students tackle challenging word problems across various mathematical topics, with top performers recognized at both regional and national levels. Open to grades 2-12. https://www.cmleague.com/product-category/cml/",
            "Harvard-MIT Math Tournament: Prestigious, student-run math competition where students tackle challenging problems in individual and team rounds. Students must apply to be selected to participate in the tournament. Open to grades 9-12. https://www.hmmt.org/rg/info",
            "InteGIRLS Math Competitions: Competitions designed specifically for girls, with the goal of encouraging and empowering young women to pursue their interests and develop their skills in mathematics. Students attempt challenging mathematical problems, learn from each other, and develop their critical thinking and problem-solving skills. Open to girls in grades 12 and under. https://www.integirls.org/math-competitions", 
            "International Youth Mathematics Challenge: Invites students to demonstrate their problem-solving skills, mathematical knowledge, and creativity, with a focus on promoting excellence in mathematics education and fostering a community of young mathematicians. Participants must complete a series of challenging mathematical problems and puzzles. Open to all ages. https://iymc.info/en/",
            "MathCON: National mathematics competition consisting of two rounds: an online test and an in-person final. The online test includes multiple-choice questions covering algebra, geometry, number theory, and combinatorics, and the top 628 scorers are invited to the finals held in Chicago, where they compete in a 100-minute exam and participate in various math-related activities. Open to grades 4-12. https://www.mathcon.org/apps/pages/registration",
            "Math Kangaroo Competition: Promotes mathematical thinking and problem-solving skills, offering students a chance to compete at multiple levels with a variety of engaging and thought-provoking problems. Open to grades 12 and under. https://mathkangaroo.org/mks/", 
            "Math League: Enhance students' problem-solving abilities through challenging questions in various mathematical topics such as algebra, geometry, and number theory. Open to grades 3-12. https://www.mathleague.org/", 
            "Mathworks Math Modeling Challenge (M3) (Difficulty ★★★★★): Nationwide competition where teams work together to develop mathematical models for solving real-world problems within a limited time frame. Students apply their creativity and mathematical skills to propose solutions and present their findings in a detailed report. Open to grades 11-12. https://m3challenge.siam.org/", 
            "Modeling the Future Challenge: National competition that combines mathematical modeling, data analysis, and risk management to address real-world issues. Participants develop projects using the actuarial process (a structured approach to identifying and analyzing risks), aiming to make informed recommendations to organizations, and governments. Open to grades 9-12. https://www.mtfchallenge.org/",
            "Pi Math Contest (Gauss Division): Mathematics competition featuring 25 multiple-choice questions to be completed in 75 minutes. The contest emphasizes problem-solving skills across topics like algebra, geometry, number theory, and combinatorics. Online and in-person tests are available. Open to grades 9-12. https://pimathcontest.com/pimc-gauss/",
            "Purple Comet! Math Meet!: Global math competition where teams  work together to solve a series of challenging problems in various mathematical areas, including algebra, geometry, and combinatorics. Open to grades 6-12. https://purplecomet.org/",
            "SIGMA Math Contest: National mathematics contest that promotes problem-solving through competition, providing students with opportunities to apply their knowledge in new ways by solving challenging mathematical problems. The contests cover a wide variety of mathematical concepts and topics. Open to grades 6-9. https://sigmamath.org/",
            "USA Mathematical Talent Search (USAMTS): Proof-based mathematics competition that emphasizes deep problem-solving over speed. Participants are given approximately one month per round to solve five challenging problems, requiring detailed written justifications. Top performers may receive prizes and qualify for the AIME. Open to grades 6-12. https://www.usamts.org/"
        ],
        "Music & Audio": [
            "American Protégé Music Competitions: International contests that provide musicians with opportunities to showcase their talents across various categories, including piano, strings, winds, brass, vocals, and composition. Participants submit video recordings for auditions, and winners are honored with performance opportunities at prestigious venues such as Carnegie Hall in New York City. Open to all grades. https://americanprotege.com/",
            "BMI Composer Awards: Annual competition that recognizes young composers engaged in creating classical music. Students submit original classical compositions for any instrumentation and genre to compete for $20,000 in prizes. Open to ages 28 and under. https://bmifoundation.org/by-application/bmicomposerawards",
            "Chris Trousdale Dream Awards: Recognizes and rewards students who demonstrate exceptional talent, dedication, and passion for music. Students submit an essay on a specific prompt relating to music or theater, with winners earning financial awards to support their artistic dreams. https://bmifoundation.org/by-application/christrousdaledreamawards",
            "Glenn Miller Music Scholarship Competition: Music competition that awards scholarships to students who demonstrate exceptional musical talent and dedication, with a focus on promoting jazz and big band music education. The competition features categories for vocalists and instrumentalists. Open to only grade 12. https://www.glennmiller.org/scholarship/scholarship-information",
            "Global International Music Competition: Students from around the world showcase their musical talents in various categories such as instrumental, vocal, and composition. Participants are judged on their technique, artistry, and creativity, with top performers receiving prizes and the chance to perform in international settings. Open to ages 6 and older. https://www.internationalmusiccompetition.org/#/",
            "Morton Gould Young Composer Awards: Encourages young music composers and recognizes their original concert music. Participants submit their original compositions, which are then judged for creativity and technical proficiency, with winners receiving prizes and professional guidance to further their compositional careers. Open to 13-30. https://www.ascapfoundation.org/programs/awards/young-composer-awards",
            "Music Teachers National Association (MTNA) Competitions: Prestigious series of music competitions, including piano, strings, woodwinds, brass, voice, and composition. High school students compete at regional, state, and national levels, demonstrating their technical ability and musical interpretation. Open to grades 6-12. https://www.mtna.org/MTNA/Engage/Competitions/Competitions.aspx",
            "Musical Theater Songwriting Challenge: Encourages students nationwide to compose original songs suitable for musical theater productions. Open to grades 9-12. https://www.arts.gov/initiatives/musical-theater-songwriting-challenge",
            "New York Times Student Podcast Contest: National competition that invites students to create and submit their own podcasts on a variety of topics, with a focus on promoting storytelling, critical thinking, and effective communication. The contest encourages students to develop their ideas, conduct research, and produce high-quality audio recordings that showcase their perspectives and voices. Open to ages 13-19.https://www.nytimes.com/2024/08/08/learning/our-student-podcast-contest.html",
            "NFMC Competitions & Awards: Encourages students to submit work in many categories such as voice, instrumental music, composition, dance, conducting, and music therapy. These competitions aim to foster musical talent and provide performance opportunities for participants. Open to all ages. https://www.nfmc-music.org/competitions-awards/",
            "SF International Innovative Music Competition: Global event where students showcase their musical talents, focusing on innovative and unique approaches to performance or composition. Participants perform or compose pieces that demonstrate creativity, technical skill, and originality. Open to ages 6 and older. https://bayareamusicassociation.org/events/competitions/sf-international-music-competition/",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18). https://youngarts.org/"
        ],
        "Nature, Horticulture, & Environmental Science": [
            "A Voice for Animals Contest: National competition that encourages students to speak out against animal cruelty and promote compassion and kindness towards all living beings, with a focus on raising awareness about animal welfare issues. Students submit either an essay or a video with their project related to animal awareness. Open to ages 14-18. https://www.hennet.org/contest.php",
            "Brower Youth Awards: Recognizes young environmental leaders from North America who have initiated impactful projects addressing ecological and social challenges. Recipients are awarded a $3,000 cash prize and are invited various leadership development activities. Open to ages 13-22. https://www.broweryouthawards.org/",
            "Demonstration In Horticulture Contest: Invites students to develop and present demonstrations that highlight environmental issues and promote sustainable horticultural practices. Participants can compete individually or in pairs, crafting presentations that may include visual aids, models, or interactive components to effectively communicate their environmental message. Open to ages 5-22. https://www.njha.org/officer-requirements-obligations-708823.html",
            "Envirothon: Environmental science competition that challenges teams of students to demonstrate their knowledge and skills in natural resource management and conservation, with a focus on ecology, wildlife, and environmental issues. Teams participate in a series of tests and hands-on activities, such as soil analysis, and wildlife identification. Open to grades 9-12. https://envirothon.org/",
            "Floral Arrangements Contest: Challenges youth to design floral displays evaluated on criteria such as category interpretation, mechanics, focal emphasis, and balance. Participants must also submit a brief statement detailing their design choices, materials used, and insights gained from the project. Open to ages 5-22. https://www.njha.org/officer-requirements-obligations-708823-676145.html",
            "Genius Olympiad: Invites students to present innovative projects in the field environmental science. Participants submit projects that aim to address global challenges, and winners receive recognition, scholarships, and the opportunity to attend the event in person to present their ideas. Open to grades 9-12. https://geniusolympiad.org/",
            "Horticulture Art Contest: creative competition that encourages youth to express horticultural themes through various art forms, such as drawing, painting, or mixed media. Participants are evaluated on creativity, composition, and how effectively their artwork conveys horticultural concepts. Open to ages 8-22. https://www.njha.org/horticulture-art-contest.html",
            "National Ocean Sciences Bowl: Nationwide academic competition focusing on oceanography and related sciences. Teams of four to five students participate in quiz-bowl style matches, answering questions on topics such as marine biology, chemistry, geology, physics, and environmental policy. Regional competitions are held across the US with top teams advancing to the national finals. Open to grades 9-12. https://nosb.org/",
            "National Wildlife Habitat Education Program (WHEP): Hands-on environmental competition focusing on wildlife and fisheries habitat management. Participants form teams of 3–4 members to engage in activities such as identifying wildlife species, interpreting aerial photographs, and developing habitat management plans. Each state conducts its own competition, and the top team advances to the national contest. Open to ages 8-19. https://www.whep.org/national-contest/",
            "NCF-Envirothon: Environmental education competition where students work in teams to tackle real-world natural resource challenges. Participants are tested in areas like forestry, wildlife, soils, aquatic ecology, and current environmental issues. Open to grades 9-12. https://envirothon.org/",
            "Ocean Awareness Contest: Global competition that challenges students to create art, writing, film, and music that explores the relationship between humans and the natural world, with a focus on promoting ocean conservation, sustainability, and environmental awareness. The contest encourages students to explore the natural world and their place in it by thinking creatively about the impact of human activities on the environment. Open to ages 11-18. https://bowseat.org/programs/ocean-awareness-contest/contest-overview/",
            "Rachel Carson Intergenerational Sense of Wonder/Sense of the Wild Contest: Encourages participants to explore and celebrate the natural world through writing, art, or other forms of expression. Aims to foster environmental awareness and appreciation, inspired by the legacy of environmentalist Rachel Carson. Must have an intergenerational team (team with multiple generations of people). https://rachelcarsonlandmarkalliance.org/rachel-carson-intergenerational-sense-of-wonder-sense-of-the-wild-contest-2022/",
            "Science and Horticulture Contest: Comprehensive competition designed to deepen students' understanding of horticulture by integrating scientific principles with practical applications. Students conduct innovative experiments to solve problems related to the art and science of horticulture. Open to ages 15-22. https://www.njha.org/officer-requirements-obligations-708823-236853-785410-701059.html",
            "Senior Horticulture Identification and Judging Contest: Comprehensive competition that challenges students to demonstrate their knowledge in plant identification, quality judging, and a written knowledge test. Participants identify various horticultural specimens, evaluate plant quality based on industry standards, and answer questions related to horticultural science. Open to ages 15-22. https://www.njha.org/officer-requirements-obligations-708823-236853-461658.html",
            "Slingshot Challenge: Students are challenged to create 1-minute videos describing their ideas for solving environmental issues around the world. Open to ages 13-18 https://www.nationalgeographic.org/society/projects/slingshot/",
            "Speaking of Horticulture Contest: Public speaking competition where participants deliver prepared speeches on horticulture-related topics. This contest aims to enhance participants' communication skills and deepen their understanding of horticultural science by encouraging them to research and present on subjects such as plant cultivation, environmental issues, or sustainable gardening practices.​ Open to ages 5-22. https://www.njha.org/officer-requirements-obligations-708823-236853-785410.html",
            "World of 8 Billion Video Contest: Invites students to create short videos that explore the challenges and opportunities presented by a world with a growing population of 8 billion people, with a focus on sustainability, resource management, and social responsibility. Participants must submit a 60-second video that addresses a specific theme or question related to population growth, such as climate change, food security, or urbanization. Open to grades 6-12. https://www.worldof8billion.org/video-contest/",
            "Writing in Horticulture Contest: Invites students to showcase their understanding and appreciation of horticulture through original writing. Submissions can include essays, poems, or stories that creatively explore topics like plant science, gardening, sustainability, or the impact of horticulture on communities. Open to ages 5-22. https://www.njha.org/officer-requirements-obligations-708823-236853-785410-701059-708757.html"            
        ],
        "Photography": [
            "NJHA Photography Contest: Invites students to showcase their horticultural knowledge and creativity through photography. Participants submit original photographs that capture horticultural subjects, with entries evaluated on composition, originality, and technical quality. Open to ages 8-22. https://www.njha.org/officer-requirements-obligations-708823-236853.html",
            "NJHA Still Film Contest: Creative competition that encourages students to express horticultural themes through still photography. Participants capture images that highlight aspects of horticulture, such as plant growth, garden landscapes, or environmental conservation, aiming to convey a compelling story or message without motion. Open to ages 8-22. https://www.njha.org/officer-requirements-obligations-708823-236853.html"
        ],
        "Physics": [
            "Beamline for Schools Competition: Students are challenged to propose an experiment that they would like to conduct using a particle accelerator, with the winning teams given the opportunity to carry out their experiment at a real research facility. The competition aims to inspire and educate students about the wonders of particle physics. Open to grades 9-12. https://beamlineforschools.cern/", 
            "F=ma Physics Competition (Difficulty ★★★★★): National exam organized by the American Association of Physics Teachers (AAPT) that serves as the preliminary selection for the U.S. Physics Team. Tests students' knowledge in Newtonian mechanics, including topics such as kinematics, dynamics, energy, momentum, and rotational motion. Open to grades 9-12. https://aapt.org/physicsteam/2024/index.cfm",
            "Physics Bowl (Difficulty ★★★☆☆): National competition where students take a 40-question, 45-minute multiple-choice exam covering topics in physics, ranging from mechanics to electricity and magnetism, with divisions based on years of physics experience. Open to grades 9-12. https://www.aapt.org/programs/physicsbowl/",
            "Sir Isaac Newton Exam: Annual physics contest organized by the University of Waterloo's Department of Physics & Astronomy, designed to promote physics education through challenging and engaging problems. Participants must ask their teacher to register for them. Open to grades 9-12. https://uwaterloo.ca/sir-isaac-newton-exam/",
            "US Invitational Young Physicists Tournament (USIYPT): Prestigious physics competition that challenges high school students to investigate, analyze, and present on complex physics problems, with a focus on developing critical thinking, research, and communication skills. Features problems that require students to conduct experiments, collect data, and develop theoretical models to explain and predict physical phenomena. Open to grades 9-12. https://www.usaypt.org/",
            "USA Physics Olympiad (USAPhO) (Difficulty ★★★★★): Students from around the U.S. solve theoretical and experimental problems that test deep understanding, creativity, and analytical skills in physics. Participants typically qualify through the F=ma Physics Competiton. Open to grades 9-12. https://www.ipho-new.org/"
        ],
        "Psychology": [
            "British Psychology Olympiad: International competition designed to be a challenging and rigorous test for participants. Aims to enhance critical thinking and problem-solving skills, while also assessing and applying students' current knowledge of psychology in real-world scenarios. Open to grades 9-12. https://www.mindsunderground.com/british-psychology-olympiad",
            "Minds Underground Psychology Essay Competition: Annual competition that invites students to submit essays on one of three given psychology-related prompts, with the goal of encouraging critical thinking, creativity, and academic excellence in the field of psychology. Open to grades 9-12. https://www.mindsunderground.com/psychology-competition",
            "International Psychology Olympiad (IPsyO): Challenges and stimulates students to expand their talents and potential to become the next generation of leaders in mind and behavior science. Students take a Grand Test on general psychology knowledge to qualify for the next round, where they take theory exams and conduct research projects. Open to grades 9-12. https://www.ipsyo.org/"
        ],
        "Robotics": [
            "BEST Robotics Competition: Challenges  students to design, build, and program robots to complete specific tasks and missions, with a focus on teamwork and innovation. The competition features a unique theme and challenge each year, requiring students to apply their knowledge of engineering, programming, and problem-solving to develop creative and effective solutions. Open to grades 6-12. https://www.bestrobotics.org/site/",
            "First Lego League: International STEM competition where students solve real-world engineering challenges by building and programming LEGO robots to complete themed missions. Teams also research a related problem and present an innovative solution, all while demonstrating core values like teamwork and leadership. Open to ages 16 and under. https://www.firstinspires.org/robotics/fll",
            "FIRST Robotics Competition: International robotics competition that challenges students to design, build, and program robots to compete in a series of challenges and games, with a focus on promoting innovation and teamwork. Starting with a kit of parts, teams of students build their unique industrial-sized robots to play an action-packed game that changes every year. Open to grades 9-12. https://www.firstinspires.org/robotics/frc",
            "National Robotics League: Invites students to participate in a robot fighting competition, gladiator style. Its goal is to teach manufacturing to kids through bot building. Open to grades 6-12. https://gonrl.org/",
            "RoboCupJunior: Challenges students to use creativity, teamwork, and problem-solving to design, build, and program robots that can compete in various leagues, including Soccer, Rescue, and OnStage. The competition culminates in the RoboCupJunior International Finals where top teams showcase their innovations. Must contact US Regional Advisor to participate. Open to ages 19 and under. https://junior.robocup.org/",
            "Vex V5 Robotics Competition: Challenges students to design, build, and program robots to compete in annual engineering challenges. Each year introduces a new game that requires teams to develop innovative solutions, fostering skills in teamwork, problem-solving, and STEM. Open to grades 6-12. https://www.robotevents.com/robot-competitions/vex-robotics-competition",
            "World Robot Olympiad (WRO): Global robotics competition that brings together students from around the world to design, build, and program robots to solve real-world problems and complete challenging tasks, with a focus on STEM. Teams of students participate in various categories, such as robotic soccer, robotic rescue, and robotic exhibition, where they must demonstrate their robots' abilities to perform specific tasks. Open to ages 8-19.  https://wro-association.org/"
        ],
        "Space": [
            "American Rocketry Challenge (Difficulty ★★★★☆): Students design their own rockets to meet rigorous requirements; they are scored on how well their rocket performs during live testing. Open to grades 6-12. https://rocketcontest.org/",
            "Cubes in Space: Invites students to design and propose experiments to be launched into space, with a focus on promoting innovation, and space exploration. The competition requires students to think creatively and develop innovative ideas for experiments that can be conducted in space, using a small cube-shaped satellite as the platform. Open to ages 11-18. https://www.cubesinspace.com/",
            "Genes in Space: Students design and propose experiments to study the effects of microgravity on living organisms, with the goal of advancing our understanding of the biological effects of space travel and potentially contributing to the development of new technologies for space exploration. Winning experiments are conducted aboard the International Space Station. Open to grades 7-12. https://www.genesinspace.org/",
            "International Astronomy and Astrophysics Competition (IAAC): Global online competition that challenges students to demonstrate their knowledge and skills in astronomy and astrophysics. The competition features a series of questions and problems that test students' understanding of astronomical concepts, theories, and phenomena, as well as their ability to think critically and solve complex problems. Open to grades 12 and under. https://iaac.space/en/",
            "International Space Olympiad (ISO): Global online competition that tests students' knowledge and skills in space science, astronomy, and related fields. Features a range of challenges and activities, including quizzes and presentations that require students to demonstrate their understanding of space-related concepts, theories, and technologies. Open to grades 5-12. https://internationalspaceolympiad.com/",
            "International Olympiad on Astronomy and Astrophysics (IOAA) (Difficulty ★★★★★): Tests students' knowledge in the fields of astronomy and astrophysics. Participants engage in theoretical, observational, and data analysis problems, challenging them to apply advanced concepts, think critically, and solve complex, real-world astronomical scenarios. Open to grades 9-12. https://www.ioaastrophysics.org/",  
            "NASA App Development Challenge: Coding competition where students address real-world technical problems related to NASA's deep space exploration missions. Participants develop software applications that contribute to the Artemis program, aiming to land astronauts on the Moon and eventually Mars. Open to grades 6-12. https://www.nasa.gov/learning-resources/app-development-challenge/",
            "NSS Gerard K. O’Neill Space Settlement Contest: Annual competition that invites students to design and submit projects focused on concepts for free space settlements, permanent habitats located in space rather than on planets or moons. Participants can submit a variety of materials, including designs, research papers, essays, models, and artwork. Open to grades 12 and under. https://space.nss.org/nss-space-settlement-contest/" 
        ],
        "STEM Research": [
            "Davidson Fellows Scholarship (Difficulty ★★★★★): Awards huge scholarships to exceptional young individuals who have completed significant projects with the potential to benefit society in areas such as science, technology, engineering, mathematics, literature, music, and philosophy. Open to ages 18 or younger. https://www.davidsongifted.org/gifted-programs/fellows-scholarship/",
            "eCYBERMISSION: Participants form teams of 2–4 students, guided by an adult Team Advisor, to identify and address a community problem using scientific inquiry or engineering design. Teams document their projects which are evaluated through virtual, regional, and national judging stages. Open to grades 6-9. https://www.ecybermission.com/",
            "Engineer Girl Annual Essay Contest: Encourages students to explore engineering's impact on society by researching and writing about real-world engineering challenges. Open to grades 3-12. https://www.engineergirl.org/154382/2025-Writing-Contest-Innovating-Smarter", 
            "Exploravision: Annual science competition that encourages students to envision new technology 10 or more years in the future through collaborative brainstorming and research of current science and technology. Open to grades K-12. https://www.exploravision.org/",
            "GSL Global Goals Competition: International competition that challenges students and young leaders to develop innovative solutions and projects that address the United Nations' Sustainable Development Goals (SDGs), with a focus on creating positive impact, driving social change, and promoting global citizenship. Open to ages 11-17. https://www.globalsocialleaders.com/ggcompetition/",
            "International Research Olympiad: recognizes and rewards outstanding research projects conducted by students in various fields of science, technology, engineering, and mathematics (STEM), with a focus on promoting innovation, critical thinking, and scientific inquiry. Participants must submit an original research project that demonstrates a significant contribution to their field of study. Open to ages 13-19. https://www.internationalresearcholympiad.org/",
            "Junior Science and Humanities Symposium: Students conduct original scientific research in STEM fields and present their findings to a panel of experts. Participants compete at regional and national levels, with opportunities for scholarships and recognition. Open to grades 9-12. https://www.jshs.org/", 
            "Modeling the Future Challenge: National competition that combines mathematical modeling, data analysis, and risk management to address real-world issues. Participants develop projects using the actuarial process (a structured approach to identifying and analyzing risks), aiming to make informed recommendations to organizations, and governments. Open to grades 9-12. https://www.mtfchallenge.org/",
            "NASA Space Apps Challenge: Students develop creative solutions to real-world problems using NASA's data, resources, and expertise, with a focus on space exploration, Earth science, and social impact. Participants form teams to design, develop, and pitch their projects, which can range from mobile apps and software to hardware and data visualizations. Open to grades 9-12. https://www.spaceappschallenge.org/",
            "Neuroscience Research Prize: Recognizes outstanding research in the field of neuroscience with the goal of promoting interest and excellence in neuroscience research. The prize is awarded to students who conduct innovative and rigorous research projects, demonstrating a deep understanding of the field and its applications. Open to grades 9-12. https://www.aan.com/research/neuroscience-research-prize",
            "Plant the Moon Challenge: Students experiment with lunar soil simulant to develop plant growth strategies for future space missions. Participants conduct research, analyze data, and present their findings to help advance space agriculture. Open to grades 9-12. and college https://plantthemoon.com/home/", 
            "Regeneron International Science and Engineering Fair (ISEF): World's largest pre-college STEM research competition, where high school students present groundbreaking independent research across various scientific categories. Open to grades 9-12. and requires qualification from local and state fairs https://www.societyforscience.org/isef/", 
            "Regeneron Science Talent Search: Nation’s most prestigious science and math competition for high school seniors, recognizing outstanding independent research. Open to only grade 12. https://www.societyforscience.org/regeneron-sts/", 
            "Samsung Solve for Tomorrow: Challenges students to develop innovative solutions to real-world problems in their communities, with a focus on science, technology, engineering, and math (STEM) education and community engagement. Teams of students, guided by teachers, work together to identify a problem, design a solution, and submit a proposal. Open to grades 6-12. https://www.samsung.com/us/solvefortomorrow/",
            "Stockholm Junior Water Prize: International competition that challenges high school students to conduct research on water-related issues, including water quality, resource management, and sustainability. Open to ages 15-20. https://siwi.org/stockholm-junior-water-prize/"
        ],
        "Theater & Playwriting": [
            "Chris Trousdale Dream Awards: Recognizes and rewards students who demonstrate exceptional talent, dedication, and passion for music. Students submit an essay on a specific prompt relating to music or theater, with winners earning financial awards to support their artistic dreams. https://bmifoundation.org/by-application/christrousdaledreamawards",
            "Princeton University Ten-Minute Play Contest: Invites students to submit original short plays, encouraging creativity in young playwrights to explore unique narratives and compelling dialogue. Open to only grade 11. https://arts.princeton.edu/about/opportunities/high-school-contests/ten-minute-play-contest/", 
            "National High School Musical Theater Awards: National celebration of outstanding student achievement, recognizing individual artistry in vocal, dance, and acting performance and elevating the importance of theatre arts education in schools. Students must be nominated as a high school team by winning their Regional Awards Program competition. Open to grades 9-12 https://www.jimmyawards.com/",
            "New Voices One-Act Competition for Young Playwrights: Theater competition that encourages young writers to submit their original one-act plays, with a focus on fostering creativity and developing the next generation of playwrights. Open to ages 19 and under. https://youthplays.com/submit_play.php",
            "Ten-Minute Play Contest: Challenges playwrights to craft concise and compelling stories within a strict 10-minute time frame, pushing the boundaries of dramatic storytelling and creativity. To enter, playwrights must submit an original play that can be performed in 10 minutes or less, with a focus on innovative storytelling, strong characters, and effective pacing. Open to only grade 11. https://arts.princeton.edu/about/opportunities/high-school-contests/ten-minute-play-contest/",
            "Writopia Lab's Worldwide Plays Festival: Global playwriting competition that invites young writers to submit their original plays, with the goal of discovering and showcasing new talent from around the world. The competition requires submissions of full-length or short plays, and selected winners will have their plays produced and performed at the festival, providing a unique opportunity for young playwrights to see their work brought to life on stage. Open to all ages. https://www.writopialab.org/programs/specialty-programs/worldwide-plays-festival/the-competition",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18). https://youngarts.org/"
        ],
        "Volunteering & Community Service": [
            "Carson Scholars Fund: Awards $1,000 college scholarships to students who excel academically and are dedicated to serving their communities. Focuses on encouraging and rewarding students for their involvement in volunteer work that benefits the community. Schools must request to be added to the distribution list in order for students to apply. Open to grades 4-11. https://carsonscholars.org/scholarships/scholarship-application-request/",
            "Gloria Barron Prize for Young Heroes (Difficulty ★★★★★): Honors 25 outstanding young leaders each year who have made significant positive impacts on people and the environment across the U.S. and Canada. Each winner receives a $10,000 award to support their higher education or service project. Open to ages 8-18 https://barronprize.org/",
            "NJCL Community Service Competition: National competition that recognizes and rewards students who have demonstrated exceptional commitment to community service and volunteer work, with a focus on promoting civic engagement, social responsibility, and character development among young people. Open to grades 9-12. https://www.njcl.org/Students/Non-Convention-Contests/NJCL-Community-Service",
            "The President's Volunteering Service Award (PVSA): Rewards students who have demonstrated a commitment to volunteering over the time frame of a year. Open to all ages. https://presidentialserviceawards.gov/"
        ],
        "Writing": [
            "Anhinga Prize for Poetry: National poetry competition that recognizes and rewards outstanding poetry collections by emerging and established poets, with a focus on promoting innovative and exceptional poetry. Open to all ages. https://www.anhingapress.org/anhinga-robert-dana-prize",
            "Carl Sandburg Student Poetry Contest: Encourages young students to write poetry based on a theme which changes each year. Each theme is one word that is left up to the poets to craft a outstanding piece of winning poetry. Open to grades 3-12. https://www.nps.gov/carl/learn/news/student-poetry-contest.html",
            "Creative Communication Writing Contests: Series of national writing competitions that recognize and reward outstanding writing by students, with a focus on promoting creative writing, self-expression, and literacy among young people. The contests invite students to submit their original writing in a variety of categories, including poetry, short stories, and essays, and provide an opportunity for students to showcase their writing talents. Open to grades K-9. https://www.poeticpower.com/",
            "Haiku Society of America: National poetry competitions that recognize and reward outstanding haiku poetry written by students, with a focus on promoting the traditional forms of Japanese poetry and encouraging young people to explore the art of haiku writing. Each competition has different age ranges for participation. https://www.hsa-haiku.org/hsa-contests.htm#virgilio",
            "Horizon Academic Essay Prize: Recognizes and rewards outstanding essays written by students on a specific topic or theme, with a focus on encouraging critical thinking, research, and writing skills. To participate, students must submit an original essay that demonstrates a deep understanding of the topic, as well as strong analytical and argumentative skills. Open to grades 9-12. https://horizoninspires.com/essay-prize/",
            "I Matter Poetry Contest: Poetry competition that invites students to write poetry different themes that promote self-expression, creativity, and empowerment among young people. For example, one of the themes was related to the importance of the Black Lives Matter Movement. Open to grades K-12. https://www.nationalyouthfoundation.org/i-matter/",
            "Jane Austen Society Essay Contest: Invites students to analyze and write about themes, characters, and historical contexts in Jane Austen’s works, fostering a deeper appreciation for her literature. Open to grades 9-12. https://jasna.org/programs/essay-contest/", 
            "John Locke Institute Essay Competition: Encourages students to develop the characteristics that create into great writers: independent thought, depth of knowledge, clear reasoning, critical analysis and persuasive style while exploring a wide range of interesting questions. Open to ages 15-18. https://www.johnlockeinstitute.com/essay-competition", 
            "Kenyon Review Poetry Contest: Literary competition that awards prizes for outstanding poetry, with the goal of recognizing and promoting exceptional poetic talent, and providing a platform for poets to share their work and gain recognition in the literary world. Open to grades 9 and 12 (Grades 10 and 11: See Patricia Grodd Poetry Prize for Young Writers). https://kenyonreview.org/submit/poetry-contest/",
            "Kenyon Review Short Fiction Contest: Literary competition that awards prizes for outstanding short fiction pieces, such as short stories, with the goal of recognizing exceptional writing and providing a platform for writers to share their work and gain recognition in the literary world. Open to grades 9-12. https://kenyonreview.org/submit/short-fiction/",
            "Kenyon Review Short Nonfiction Contest: Literary competition that awards prizes for outstanding short nonfiction pieces, such as essays and memoir excerpts, with the goal of recognizing and promoting exceptional nonfiction writing, and providing a platform for writers to share their work and gain recognition in the literary world. Open to grades 9-12. https://kenyonreview.org/submit/short-nonfiction-contest/",
            "Manningham Student Poetry Awards: Poetry competition that recognizes and rewards outstanding poetry written by students. Aims to showcase their poetic talents and receive feedback and recognition from established poets and literary critics, with the goal of encouraging and nurturing a love of poetry and creative writing among students. Open to grades 6-12. https://www.nfsps.com/manningham.html",
            "Max Ritvo Poetry Prize: National poetry competition that recognizes and rewards outstanding poetry collections by emerging poets to provide a platform for poets to share their work with a wider audience, while also honoring the legacy of Max Ritvo, a talented young poet who passed away in 2016. Open to all ages. https://milkweed.org/max-ritvo-poetry-prize",
            "National Scholastic Art & Writing Awards: Recognizes creative excellence in writing, offering students opportunities for scholarships and national recognition. Open to grades 7-12. https://www.artandwriting.org/awards/how-to-enter/", 
            "New York Times Student Review Contest: Invites students worldwide to craft original reviews of creative works that debuted in a specific year. Participants can choose from a wide array of categories, including books, movies, music, art, fashion, technology, and more. Each review must be 450 words or fewer and reflect the student's personal experience and perspective. Open to ages 13-19. https://www.nytimes.com/2023/10/24/learning/our-9th-annual-student-review-contest.html",
            "Patricia Grodd Poetry Prize for Young Writers: Literary competition that awards prizes for outstanding poetry, with the goal of recognizing and promoting exceptional poetic talent, and providing a platform for poets to share their work and gain recognition in the literary world. Open to grades 10 and 11 (Grades 9 and 12: See Kenyon Review Poetry Contest). https://kenyonreview.org/submit/patricia-grodd/",
            "Poetry Society of America: National organization that promotes and celebrates poetry in all its forms, with a focus on supporting poets, fostering a love of poetry, and providing opportunities for poets to share their work with a wider audience. Offers many different programs and awards. Each award may be open to different age ranges. https://poetrysociety.org/awards/annual-awards/2022-student-poetry",
            "Princeton Leonard L. Milberg ’53 High School Poetry Prize: Recognizes outstanding work by student writers, encouraging students to showcase their talent and creativity through the power of poetry. Open to only grade 11. https://arts.princeton.edu/about/opportunities/high-school-contests/poetry-contest/", 
            "REALM Award: Recognizes excellent literary magazines produced by students and encourages all students to develop literary magazines that celebrate the art and craft of writing. Open to grades 6-12. https://ncte.org/awards/realm-awards/apply/",
            "River of Words Contest: National poetry and art contest that invites students to explore and express their connection to the natural world, with a focus on promoting environmental awareness, creativity, and self-expression. The contest encourages students to submit their original poetry and artwork that reflects their observations, feelings, and thoughts about the natural world. Open to grades K-12. https://www.stmarys-ca.edu/centers-institutes/center-environmental-literacy/river-of-words",
            "Sejong Cultural Society Poetry Competition: National poetry competition that recognizes and rewards outstanding poetry written by students, with a focus on promoting Korean culture and language, as well as creative writing and literary excellence among young people. Open to all ages. https://www.sejongculturalsociety.org/writing/current/index.php",
            "SPJ/JEA High School Essay Contest: Prompts students to explore the importance of journalism and the First Amendment's freedom of press by writing essays on a given prompt. Open to grades 9-12. https://jea.org/awards/spj-jea-high-school-essay-contest/",
            "Storytellers of Tomorrow Writing Contest: Invites students to submit their original stories of up to 2000 words. Stories are graded on their overall quality and ability to engage the reader with their rhetoric. Open to grades 9-12. https://www.ringling.edu/academics/majors/creative-writing/storytellers-of-tomorrow/",
            "The Adroit Prizes for Poetry & Prose (Difficulty ★★★★★): Annual awards that recognize the best emerging writers in the genres of poetry and prose, with the goal of promoting literary excellence, encouraging new voices, and providing a platform for young writers to share their work and gain recognition in the literary community. Open to grades 9-12. https://theadroitjournal.org/adroit-prizes/",
            "The Bennington Young Writers Awards: Invites students to submit original poetry, fiction, and nonfiction works, providing an opportunity for young writers to showcase their creativity and literary talent. Open to grades 9-12. https://www.bennington.edu/events/young-writers-awards", 
            "Writing in Horticulture Contest: Invites students to showcase their understanding and appreciation of horticulture through original writing. Submissions can include essays, poems, or stories that creatively explore topics like plant science, gardening, sustainability, or the impact of horticulture on communities. Open to ages 5-22. https://www.njha.org/officer-requirements-obligations-708823-236853-785410-701059-708757.html",
            "Writing, Visual, Multimedia Contest: creative competition that challenges students to express their thoughts, ideas, and imagination through a variety of mediums, including writing, visual arts, and media productions. The contest invites students to submit their original work and to showcase their skills in storytelling, critical thinking, and creative expression. Open to grades 6-12. https://quillandscroll.org/2024-writing-photo-multimedia-contest-results/",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18). https://youngarts.org/"
        ]
    }
}
